tinyos/tinyos-main/tos/platforms/exp_msp432/startup.c
/*
 * Copyright (c) 2016 Eric B. Decker
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * - Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * - Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in the
 *   documentation and/or other materials provided with the
 *   distribution.
 *
 * - Neither the name of the Stanford University nor the names of
 *   its contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL STANFORD
 * UNIVERSITY OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * @author Eric B. Decker <cire831@gmail.com>
 *
 * Vector table for msp432 cortex-m4f processor.
 * Startup code and interrupt/trap handlers for the msp432 processors.
 * initial h/w initilization.  In particular clocks and first stage
 * of timer h/w.  See below for h/w initilization.
 */

#include <stdint.h>
#include <msp432.h>
#include <cs.h>

/*
 * msp432.h find the right chip header (msp432p401r.h) which also pulls in
 * the correct cmsis header (core_cm4.h).
 *
 * If __MSP432_DVRLIB_ROM__ is defined driverlib calls will be made to
 * the ROM copy on board the msp432 chip.
 */

extern uint32_t __data_load__;
extern uint32_t __data_start__;
extern uint32_t __data_end__;
extern uint32_t __bss_start__;
extern uint32_t __bss_end__;
extern uint32_t __StackTop__;

/* pull in the type definitions.  won't allocate any space */
SCB_Type                    *__scb;
SCnSCB_Type                 *__scnscb;
SysTick_Type                *__systick;
NVIC_Type                   *__nvic;
ITM_Type                    *__itm;
DWT_Type                    *__dwt;
TPI_Type                    *__tpi;
CoreDebug_Type              *__cd;
MPU_Type                    *__mpu;
FPU_Type                    *__fpu;

RSTCTL_Type                 *__rstctl;
SYSCTL_Type                 *__sysctl;
SYSCTL_Boot_Type            *__sysboot;
CS_Type                     *__cs;
PSS_Type                    *__pss;
PCM_Type                    *__pcm;
FLCTL_Type                  *__flctl;
DMA_Channel_Type            *__dmachn;
DMA_Control_Type            *__dmactl;
PMAP_COMMON_Type            *__pmap;
PMAP_REGISTER_Type          *__p1map;
CRC32_Type                  *__crc32;
AES256_Type                 *__aes256;
WDT_A_Type                  *__wdt;
Timer32_Type                *__t32;
Timer_A_Type                *__ta0;
RTC_C_Type                  *__rtc;
REF_A_Type                  *__ref;
ADC14_Type                  *__adc14;
EUSCI_A_Type                *_uca0;
EUSCI_B_Type                *_ucb0;
FL_BOOTOVER_MAILBOX_Type    *__bomb;
TLV_Type                    *__tlv;


int  main();                    /* main() symbol defined in RealMainP */
void __Reset();                 /* start up entry point */
void __system_init();

void HardFault_Handler() __attribute__((interrupt));
void HardFault_Handler() {
  __bkpt();
  /* If set, make sure to clear:
   *
   * CFSR.MMARVALID, BFARVALID
   */
  while (1) {
    __nop();
  }
}

#ifdef notdef

typedef struct {
  uint32_t rtc_val;
  uint32_t usec_val;
} rtc_usec_t;

#define RTC_SIZE 1024

rtc_usec_t rtc_vals[RTC_SIZE];

uint32_t rtc_idx;
uint32_t ty_usecs;

void T32_INT2_Handler() __attribute__((interrupt));
void T32_INT2_Handler() {
  uint32_t v1, v2;

  TIMER32_2->INTCLR = 0;        /* clear the interrupt */
  ty_usecs++;

  /*
   * also grab the current PS value from the RTC for comparison
   *
   * read twice since Tmilli is async to the main clock
   */
  v1 = RTC_C->PS;
  v2 = RTC_C->PS;
  if (v1 != v2)
    v1 = RTC_C->PS;
  if (v1 != v2) {
    __bkpt();
  }
  rtc_vals[rtc_idx].rtc_val = v1;
  rtc_vals[rtc_idx++].usec_val = ty_usecs;
  if (rtc_idx >= RTC_SIZE)
    rtc_idx = 0;
  BITBAND_PERI(P1->OUT, 0) ^= 1;
}

#endif


void __default_handler()  __attribute__((interrupt));
void __default_handler() {
  __bkpt(1);
}


/*
 * Unless overridded, most handlers get aliased to __default_handler.
 */

void Nmi_Handler()        __attribute__((weak));
//void HardFault_Handler()  __attribute__((weak));
void MpuFault_Handler()   __attribute__((weak));
void BusFault_Handler()   __attribute__((weak));
void UsageFault_Handler() __attribute__((weak));
void SVCall_Handler()     __attribute__((weak));
void Debug_Handler()      __attribute__((weak));
void PendSV_Handler()     __attribute__((weak));
void SysTick_Handler()    __attribute__((weak));

void Nmi_Handler()        { __bkpt(1); while(1) { __nop(); } }
//void HardFault_Handler()  { __bkpt(1); while(1) { __nop(); } }
void MpuFault_Handler()   { __bkpt(1); while(1) { __nop(); } }
void BusFault_Handler()   { __bkpt(1); /* while(1) { __nop(); }*/ }
void UsageFault_Handler() { __bkpt(1); while(1) { __nop(); } }
void SVCall_Handler()     { __bkpt(1); while(1) { __nop(); } }
void Debug_Handler()      { __bkpt(1); while(1) { __nop(); } }
void PendSV_Handler()     { __bkpt(1); while(1) { __nop(); } }
void SysTick_Handler()    { __bkpt(1); while(1) { __nop(); } }

void PSS_Handler()        __attribute__((weak, alias("__default_handler")));
void CS_Handler()         __attribute__((weak, alias("__default_handler")));
void PCM_Handler()        __attribute__((weak, alias("__default_handler")));
void WDT_Handler()        __attribute__((weak, alias("__default_handler")));
void FPU_Handler()        __attribute__((weak, alias("__default_handler")));
void FLCTL_Handler()      __attribute__((weak, alias("__default_handler")));
void COMP0_Handler()      __attribute__((weak, alias("__default_handler")));
void COMP1_Handler()      __attribute__((weak, alias("__default_handler")));
void TA0_0_Handler()      __attribute__((weak, alias("__default_handler")));
void TA0_N_Handler()      __attribute__((weak, alias("__default_handler")));
void TA1_0_Handler()      __attribute__((weak, alias("__default_handler")));
void TA1_N_Handler()      __attribute__((weak, alias("__default_handler")));
void TA2_0_Handler()      __attribute__((weak, alias("__default_handler")));
void TA2_N_Handler()      __attribute__((weak, alias("__default_handler")));
void TA3_0_Handler()      __attribute__((weak, alias("__default_handler")));
void TA3_N_Handler()      __attribute__((weak, alias("__default_handler")));
void EUSCIA0_Handler()    __attribute__((weak, alias("__default_handler")));
void EUSCIA1_Handler()    __attribute__((weak, alias("__default_handler")));
void EUSCIA2_Handler()    __attribute__((weak, alias("__default_handler")));
void EUSCIA3_Handler()    __attribute__((weak, alias("__default_handler")));
void EUSCIB0_Handler()    __attribute__((weak, alias("__default_handler")));
void EUSCIB1_Handler()    __attribute__((weak, alias("__default_handler")));
void EUSCIB2_Handler()    __attribute__((weak, alias("__default_handler")));
void EUSCIB3_Handler()    __attribute__((weak, alias("__default_handler")));
void ADC14_Handler()      __attribute__((weak, alias("__default_handler")));
void T32_INT1_Handler()   __attribute__((weak, alias("__default_handler")));
void T32_INT2_Handler()   __attribute__((weak, alias("__default_handler")));
void T32_INTC_Handler()   __attribute__((weak, alias("__default_handler")));
void AES_Handler()        __attribute__((weak, alias("__default_handler")));
void RTC_Handler()        __attribute__((weak, alias("__default_handler")));
void DMA_ERR_Handler()    __attribute__((weak, alias("__default_handler")));
void DMA_INT3_Handler()   __attribute__((weak, alias("__default_handler")));
void DMA_INT2_Handler()   __attribute__((weak, alias("__default_handler")));
void DMA_INT1_Handler()   __attribute__((weak, alias("__default_handler")));
void DMA_INT0_Handler()   __attribute__((weak, alias("__default_handler")));
void PORT1_Handler()      __attribute__((weak, alias("__default_handler")));
void PORT2_Handler()      __attribute__((weak, alias("__default_handler")));
void PORT3_Handler()      __attribute__((weak, alias("__default_handler")));
void PORT4_Handler()      __attribute__((weak, alias("__default_handler")));
void PORT5_Handler()      __attribute__((weak, alias("__default_handler")));
void PORT6_Handler()      __attribute__((weak, alias("__default_handler")));


