tinyos/tinyos-main/tos/platforms/exp_msp432/startup.c
void (* const __vectors[])(void) __attribute__ ((section (".vectors"))) = {
//    handler                              IRQn      exceptionN     priority
  (void (*)(void))(&__StackTop__),      // -16          0
  __Reset,                              // -15          1           -3

  Nmi_Handler,                          // -14          2           -2
  HardFault_Handler,                    // -13          3           -1
  MpuFault_Handler,                     // -12          4
  BusFault_Handler,                     // -11          5
  UsageFault_Handler,                   // -10          6
  0,                                    // -9           7
  0,                                    // -8           8
  0,                                    // -7           9
  0,                                    // -6           10
  SVCall_Handler,                       // -5           11
  Debug_Handler,                        // -4           12
  0,                                    // -3           13
  PendSV_Handler,                       // -2           14
  SysTick_Handler,                      // -1           15
  PSS_Handler,                          //  0           16
  CS_Handler,                           //  1           17
  PCM_Handler,                          //  2           18
  WDT_Handler,                          //  3           19
  FPU_Handler,                          //  4           20
  FLCTL_Handler,                        //  5           21
  COMP0_Handler,                        //  6           22
  COMP1_Handler,                        //  7           23
  TA0_0_Handler,                        //  8           24
  TA0_N_Handler,                        //  9           25
  TA1_0_Handler,                        // 10           26
  TA1_N_Handler,                        // 11           27
  TA2_0_Handler,                        // 12           28
  TA2_N_Handler,                        // 13           29
  TA3_0_Handler,                        // 14           30
  TA3_N_Handler,                        // 15           31
  EUSCIA0_Handler,                      // 16           32
  EUSCIA1_Handler,                      // 17           33
  EUSCIA2_Handler,                      // 18           34
  EUSCIA3_Handler,                      // 19           35
  EUSCIB0_Handler,                      // 20           36
  EUSCIB1_Handler,                      // 21           37
  EUSCIB2_Handler,                      // 22           38
  EUSCIB3_Handler,                      // 23           39
  ADC14_Handler,                        // 24           40
  T32_INT1_Handler,                     // 25           41
  T32_INT2_Handler,                     // 26           42          5 (a0)
  T32_INTC_Handler,                     // 27           43
  AES_Handler,                          // 28           44
  RTC_Handler,                          // 29           45
  DMA_ERR_Handler,                      // 30           46
  DMA_INT3_Handler,                     // 31           47
  DMA_INT2_Handler,                     // 32           48
  DMA_INT1_Handler,                     // 33           49
  DMA_INT0_Handler,                     // 34           50
  PORT1_Handler,                        // 35           51
  PORT2_Handler,                        // 36           52
  PORT3_Handler,                        // 37           53
  PORT4_Handler,                        // 38           54
  PORT5_Handler,                        // 39           55
  PORT6_Handler,                        // 40           56
  __default_handler,                    // 41           57
  __default_handler,                    // 42           58
  __default_handler,                    // 43           59
  __default_handler,                    // 44           60
  __default_handler,                    // 45           61
  __default_handler,                    // 46           62
  __default_handler,                    // 47           63
  __default_handler,                    // 48           64
  __default_handler,                    // 49           65
  __default_handler,                    // 50           66
  __default_handler,                    // 51           67
  __default_handler,                    // 52           68
  __default_handler,                    // 53           69
  __default_handler,                    // 54           70
  __default_handler,                    // 55           71
  __default_handler,                    // 56           72
  __default_handler,                    // 57           73
  __default_handler,                    // 58           74
  __default_handler,                    // 59           75
  __default_handler,                    // 60           76
  __default_handler,                    // 61           77
  __default_handler,                    // 62           78
  __default_handler                     // 63           79
};


/*
 * Exception/Interrupt system initilization
 *
 * o enable all faults to go to their respective handlers
 *   mpu still hardfaults.
 *   others are caught with __bkpt()
 *
 * Potential issue with PendSV.
 * http://embeddedgurus.com/state-space/2011/09/whats-the-state-of-your-cortex/
 */

#define DIV0_TRAP       SCB_CCR_DIV_0_TRP_Msk
#define UNALIGN_TRAP    SCB_CCR_UNALIGN_TRP_Msk
#define USGFAULT_ENA    SCB_SHCSR_USGFAULTENA_Msk
#define BUSFAULT_ENA    SCB_SHCSR_BUSFAULTENA_Msk
#define MPUFAULT_ENA    SCB_SHCSR_MEMFAULTENA_Msk

void __exception_init() {
  SCB->CCR |= (DIV0_TRAP | UNALIGN_TRAP);
}


void __watchdog_init() {
  WDT_A->CTL = WDT_A_CTL_PW | WDT_A_CTL_HOLD;         // Halt the WDT
}


void __pins_init() {

  /*
   * P1.0 is a red led, turn it on following power on
   * P1.1 is a switch, needs pull up
   * P1.4 is a switch, needs pull up
   * P2.{0,1,2} is a 3 input led.
   */
  P1->OUT = 0x12;               /* P1.1/P1.4 need pull up */
  P1->DIR = 1;
  P1->REN = 0x12;
  P1->IFG = 0;

  P2->OUT = 0;
  P2->DIR = 7;

  /*
   * We bring the clocks out so we can watch them.
   *
   * P4.2 ACLK,   Opx,01 (Output/Port/Val/Sel01)
   * P4.3 MCLK,   Opx,01
   *      RTCCLK, Opx,10
   * P4.4 HSMCLK, Opx,01
   * P7.0 PM_SMCLK, Opx,01
   *
   * 7 6 5 4 3 2 1 0
   * 0 0 0 1 1 1 0 0
   */
  P4->DIR  = 0x1C;
  P4->SEL0 = 0x1C;
  P4->SEL1 = 0x00;
  P7->DIR  = 0x01;
  P7->SEL0 = 0x01;
  P7->SEL1 = 0x00;
}


inline void __fpu_on() {
  SCB->CPACR |=  ((3UL << 10 * 2) | (3UL << 11 * 2));
}

inline void __fpu_off() {
  SCB->CPACR &= ~((3UL << 10 * 2) | (3UL << 11 * 2));
}


