tinyos/tinyos-main/tos/platforms/exp_msp432/startup.c
/*
 * Debug Init
 *
 * o turn various clocks to periphs when debug halt
 * o enable various fault system handlers to trip.
 * o turn on div0 and unaligned traps
 *
 * SCB->CCR(STKALIGN) is already set (from RESET)
 *
 * Do we want (SCnSCB->ACTLR) disfold, disdefwbuf, dismcycint?
 * disdefwbuf, we set for precise busfaults
 *
 * what about cd->demcr (vc_bits) vector catch
 * see dhcsr for access.
 */

void __debug_init() {
  CoreDebug->DHCSR |= CoreDebug_DHCSR_C_MASKINTS_Msk;
  CoreDebug->DEMCR |= (
    CoreDebug_DEMCR_VC_HARDERR_Msk      |
    CoreDebug_DEMCR_VC_INTERR_Msk       |
    CoreDebug_DEMCR_VC_BUSERR_Msk       |
    CoreDebug_DEMCR_VC_STATERR_Msk      |
    CoreDebug_DEMCR_VC_CHKERR_Msk       |
    CoreDebug_DEMCR_VC_NOCPERR_Msk      |
    CoreDebug_DEMCR_VC_MMERR_Msk        |
    CoreDebug_DEMCR_VC_CORERESET_Msk);

  /* disable default write buffering.  change all busfaults into precise */
  SCnSCB->ACTLR |= SCnSCB_ACTLR_DISDEFWBUF_Msk;

  SYSCTL->PERIHALT_CTL =
    SYSCTL_PERIHALT_CTL_HALT_T16_0      |       /* TA0 TMicro */
    SYSCTL_PERIHALT_CTL_HALT_T16_1      |       /* TA1 TMilli */
    SYSCTL_PERIHALT_CTL_HALT_T16_2      |
    SYSCTL_PERIHALT_CTL_HALT_T16_3      |
    SYSCTL_PERIHALT_CTL_HALT_T32_0      |       /* raw usecs */
    SYSCTL_PERIHALT_CTL_HALT_EUA0       |
    SYSCTL_PERIHALT_CTL_HALT_EUA1       |
    SYSCTL_PERIHALT_CTL_HALT_EUA2       |
    SYSCTL_PERIHALT_CTL_HALT_EUA3       |
    SYSCTL_PERIHALT_CTL_HALT_EUB0       |
    SYSCTL_PERIHALT_CTL_HALT_EUB1       |
    SYSCTL_PERIHALT_CTL_HALT_EUB2       |
    SYSCTL_PERIHALT_CTL_HALT_EUB3       |
    SYSCTL_PERIHALT_CTL_HALT_ADC        |
    SYSCTL_PERIHALT_CTL_HALT_WDT        |
    SYSCTL_PERIHALT_CTL_HALT_DMA
    ;
}

void __ram_init() {
  SYSCTL->SRAM_BANKEN = SYSCTL_SRAM_BANKEN_BNK7_EN;   // Enable all SRAM banks
}


void __flash_init() {
  /*
   * For now turn off buffering, (FIXME) check to see if buffering makes
   * a difference when running at 16MHz
   */
  FLCTL->BANK0_RDCTL &= ~(FLCTL_BANK0_RDCTL_BUFD | FLCTL_BANK0_RDCTL_BUFI);
  FLCTL->BANK1_RDCTL &= ~(FLCTL_BANK1_RDCTL_BUFD | FLCTL_BANK1_RDCTL_BUFI);
}


#define T32_DIV_16 TIMER32_CONTROL_PRESCALE_1
#define T32_ENABLE TIMER32_CONTROL_ENABLE
#define T32_32BITS TIMER32_CONTROL_SIZE
#define T32_PERIODIC TIMER32_CONTROL_MODE

void __t32_init() {
  Timer32_Type *tp = TIMER32_1;

  /* MCLK/16 (1MHz, 1us), enable, freerunning, no int, 32 bits, wrap */
  tp->LOAD = 0xffffffff;
  tp->CONTROL = T32_DIV_16 | T32_ENABLE | T32_32BITS;

  /*
   * Using Ty as a 1 second ticker.
   */
  tp = TIMER32_2;
  tp->LOAD = 1000000;           /* 1 MHz */
  tp->CONTROL = T32_DIV_16 | T32_ENABLE | T32_32BITS | T32_PERIODIC;
}


#define CLK_DCOTUNE 134

/*
 * DCOSEL_3:    center 12MHz (~8 < 12 < 16, but is actually larger)
 * DCORES:      external resistor
 * DCOTUNE:     +134 (0x86), moves us up to 16MHz.
 * ACLK:        LFXTCLK/1       32768
 * BCLK:        LFXTCLK/1       32768
 * SMCLK:       DCO/2           8MHz
 * HSMCLK:      DCO/1           16MHz
 * MCLK:        DCO/1           16MHz
 *
 * LFXTDRIVE:   3 max (default).
 *
 * CLKEN:       SMCLK/HSMCLK/MCLK/ACLK enabled (default)
 *
 * PJ.0/PJ.1    LFXIN/LFXOUT need to be in crystal mode (Sel01)
 *
 * DO NOT MESS with PJ.4 and PJ.5 (JTAG pins, TDO and TDI)
 *
 * Research Fault counts and mechanisms for oscillators.
 * Research stabilization
 * Research CS->DCOERCAL{0,1}
 */

/*
 * CLK_DCOTUNE was determined by running CS_setDCOFrequency(TARGET_FREQ)
 * and seeing what it produced.  We then a) understand and b) make
 * use of the result.  This was from driverlib.  We have observed with a
 * scope clocking at 16MHz.  No idea of the tolerance or variation.
 *
 * DCO tuning is discussed in AppReport SLAA658A, Multi-Frequency Range
 * and Tunable DCO on MSP432P4xx Microcontrollers.
 * (http://www.ti.com/lit/an/slaa658a/slaa658a.pdf).
 *
 * According to https://e2e.ti.com/support/microcontrollers/msp430/f/166/t/411030
 * and page 52 of datasheet (SLAS826E) the DCO with external resistor has a
 * tolerance of worst case +/- 0.6%.  Which gives us a frequency range of
 * 15904000 to 16096000 Hz.
 *
 * We have observed LFXT (crystal) taking ~1.5s to stabilize.  This was
 * timed using TX (Timer32_1) clocking DCOCLK/16 to get 1us ticks.  This
 * assumes the DCOCLK comes right up and is stable.  According to the
 * datasheet (SLAS826E, msp432p401), DCO settling time changing DCORSEL
 * is 10us and t_start is 5 us so we should be good.
 */

#define CLK_DCOTUNE 152

uint32_t lfxt_startup_time;
uint32_t dco_freq, aclk_freq, bclk_freq, hsmclk_freq, smclk_freq, mclk_freq;

void __core_clk_init() {
  uint32_t timeout;

  CS_enableDCOExternalResistor();
  CS_setDCOFrequency(16777216);

  /*
   * only change from internal res to external when dco in dcorsel_1.
   * When first out of POR, DCORSEL will be 1, once we've set DCORES
   * it stays set and we no longer care about changing it (because
   * it always stays 1).
   */
  CS->KEY = CS_KEY_VAL;
  CS->CTL0 = CS_CTL0_DCORSEL_3 | CS_CTL0_DCORES | CLK_DCOTUNE;
  CS->CTL1 = CS_CTL1_SELS__DCOCLK  | CS_CTL1_DIVS__2 | CS_CTL1_DIVHS__1 |
             CS_CTL1_SELA__LFXTCLK | CS_CTL1_DIVA__1 |
             CS_CTL1_SELM__DCOCLK  | CS_CTL1_DIVM__1;

  /*
   * turn on the t32s running off MCLK (16Mhz/16 -> 1MHz) so we can
   * time the turn on of the remainder of the system.
   */
  __t32_init();                   /* rawUsecs */

  /*
   * turn on the 32Ki LFXT system by enabling the LFXIN LFXOUT pins
   * Do not tweak the SELs on PJ.4/PJ.5, they are reset to the proper
   * values for JTAG access.  If you tweak them the debug connection goes
   * south.
   */
  BITBAND_PERI(PJ->SEL0, 0) = 1;
  BITBAND_PERI(PJ->SEL0, 1) = 1;
  BITBAND_PERI(PJ->SEL1, 0) = 0;
  BITBAND_PERI(PJ->SEL1, 1) = 0;

  /* turn on LFXT and wait for the fault to go away */
  timeout = 0;
  BITBAND_PERI(CS->CTL2, CS_CTL2_LFXT_EN_OFS) = 1;
  while (BITBAND_PERI(CS->IFG, CS_IFG_LFXTIFG_OFS)) {
    if (--timeout == 0) {
      CS->IFG;
      CS->STAT;
      __bkpt(0);                /* panic?  what to do, what to do */
    }
    BITBAND_PERI(CS->CLRIFG,CS_CLRIFG_CLR_LFXTIFG_OFS) = 1;
  }
  CS->KEY = 0;
  lfxt_startup_time = -TIMER32_1->VALUE;
}


#define TA_FREERUN      TIMER_A_CTL_MC__CONTINUOUS
#define TA_CLR          TIMER_A_CTL_CLR
#define TA_ACLK1        (TIMER_A_CTL_SSEL__ACLK  | TIMER_A_CTL_ID__1)
#define TA_SMCLK8       (TIMER_A_CTL_SSEL__SMCLK | TIMER_A_CTL_ID__8)

void __ta_init(Timer_A_Type * tap, uint32_t clkdiv) {
  tap->EX0 = TIMER_A_EX0_IDEX__1;
  tap->CTL = TA_FREERUN | TA_CLR | clkdiv;
  tap->R = 0;
}


void __rtc_init() {
  RTC_C_Type *rtc = RTC_C;

  /* write the key, and nuke any interrupt enables */
  rtc->CTL0 = RTC_C_KEY;
  rtc->CTL13 = RTC_C_CTL13_HOLD;
  rtc->PS = 0;
  rtc->TIM0 = 0;
  rtc->TIM1 = 0;
  rtc->DATE = 0;
  rtc->YEAR = 0;
  rtc->CTL0 = 0;                /* close the lock */
}


void __start_timers() {
  /* let the RTC go */
  RTC_C->CTL0 = RTC_C_KEY;
  BITBAND_PERI(RTC_C->CTL13, RTC_C_CTL13_HOLD_OFS) = 0;
  RTC_C->CTL0 = 0;                /* close the lock */

  /* restart the 32 bit 1MHz tickers */
  TIMER32_1->LOAD = 0xffffffff;
  TIMER32_2->LOAD = 1000000;
}


/**
 * Initialize the system
 *
 * Comment about initial CPU state
 *
 * Desired configuration:
 *
 * LFXTCLK -> ACLK, BCLK
 * HFXTCLK off
 * MCLK (Main Clock) - 16MHz, <- DCOCLK/1
 * HSMCLK (high speed submain) <- DCOCLK/1 16MHz (can be faster than 12 MHz)
 *     only can drive ADC14.
 * SMCLK (low speed submain)   DCOCLK/2, 8MHz (dont exceed 12MHz)
 * SMCLK/8 -> TA0 (1us) -> TMicro
 * ACLK/1 (32KiHz) -> TA1 (1/32768) -> TMilli
 * BCLK/1 (32KiHz) -> RTC
 *
 * Timers:
 *
 * RTCCLK <- BCLK/1 (32Ki)
 * TMicro <-  TA0 <- SMCLK/8 <- DCO/2 (1MHz)
 * TMilli <-  TA1 <- ACLK/1 (32KiHz)
 * rawUsecs<- T32_1 <- MCLK/16 <- DCO/1 32 bit raw usecs
 * rawJiffies<- TA0 <- ACLK/1 (32KiHz) 16 bits wide
 */

void __system_init(void) {
  __fpu_on();
  __exception_init();
  __debug_init();
  __ram_init();
  __flash_init();
  BITBAND_PERI(P1->OUT, 0) = 1;
  __core_clk_init();
  BITBAND_PERI(P1->OUT, 0) = 0;

  __ta_init(TIMER_A0, TA_SMCLK8); /* Tmicro */
  __ta_init(TIMER_A1, TA_ACLK1);  /* Tmilli */
  __rtc_init();
  __start_timers();
  dco_freq    = CS_getDCOFrequency();
  aclk_freq   = CS_getACLK();
  bclk_freq   = CS_getBCLK();
  hsmclk_freq = CS_getHSMCLK();
  smclk_freq  = CS_getSMCLK();
  mclk_freq   = CS_getMCLK();
  __fpu_off();
}


/*
 * Start-up code
 *
 * Performs the following:
 *   o turns off interrupts (primask)
 *   o copy _data (preinitilized data) into RAM
 *   o zero BSS segment
 *   o move the interrupt vectors if required.
 *   o call __system_init() to bring up required system modules
 *   o call main()
 *   o handle exit from main() (shouldn't happen)
 *
 * leaves interrupts off
 *
 * experiment with configurable/permanent bkpts:
 *      https://answers.launchpad.net/gcc-arm-embedded/+question/248410
 */

void start() __attribute__((alias("__Reset")));
void __Reset() {
  uint32_t *from;
  uint32_t *to;

  __disable_irq();
  __watchdog_init();
  __pins_init();

  from = &__data_load__;
  to   = &__data_start__;;
  while (to < &__data_end__) {
    *to++ = *from++;
  }

  // Fill BSS data with 0
  to = &__bss_start__;
  while (to < &__bss_end__) {
    *to++ = 0;
  }

  __system_init();
  main();
  while (1) {
    __BKPT(0);
  }
}
